[Killed] Boolean mutation
Desktop/MagicNumber/MagicNumber/MagicNumberChecker.cs:10:24
         public bool IsMagicNumber(int number)
         {
             if (number <= 0)
-                return false;
+                return true;
 
             return number % 3 == 0 && number.ToString().Contains('3');
killedBy: MagicNumberTests.MagicNumberCheckerTests.TestIsMagicNumber(-3); MagicNumberTests.MagicNumberCheckerTests.TestIsMagicNumber(0)

[Killed] Arithmetic mutation
Desktop/MagicNumber/MagicNumber/MagicNumberChecker.cs:12:20
             if (number <= 0)
                 return false;
 
-            return number % 3 == 0 && number.ToString().Contains('3');
+            return number * 3 == 0 && number.ToString().Contains('3');
         }
     }
killedBy: MagicNumberTests.MagicNumberCheckerTests.TestIsMagicNumber(3); MagicNumberTests.MagicNumberCheckerTests.TestIsMagicNumber(33)

[Killed] Logical mutation
Desktop/MagicNumber/MagicNumber/MagicNumberChecker.cs:12:20
             if (number <= 0)
                 return false;
 
-            return number % 3 == 0 && number.ToString().Contains('3');
+            return number % 3 == 0 || number.ToString().Contains('3');
         }
     }
killedBy: MagicNumberTests.MagicNumberCheckerTests.TestIsMagicNumber(13); MagicNumberTests.MagicNumberCheckerTests.TestIsMagicNumber(9)
