[Killed] Negate expression
09.StringManipulatorProject/StringManipulator/StringManipulator/StringUtilities.cs:9:17
     {
         public static bool IsPalindrome(string input)
         {
-            if (string.IsNullOrWhiteSpace(input)) return false;
+            if (!(string.IsNullOrWhiteSpace(input))) return false;
             input = input.ToLower().Replace(" ", "");
             char[] arr = input.ToCharArray();
killedBy: StringManipulator.Tests.StringUtilitiesTests.TestIsPalindrome_True

[NoCoverage] Boolean mutation
09.StringManipulatorProject/StringManipulator/StringManipulator/StringUtilities.cs:9:58
     {
         public static bool IsPalindrome(string input)
         {
-            if (string.IsNullOrWhiteSpace(input)) return false;
+            if (string.IsNullOrWhiteSpace(input)) return true;
             input = input.ToLower().Replace(" ", "");
             char[] arr = input.ToCharArray();

[Killed] String mutation
09.StringManipulatorProject/StringManipulator/StringManipulator/StringUtilities.cs:10:50
         public static bool IsPalindrome(string input)
         {
             if (string.IsNullOrWhiteSpace(input)) return false;
-            input = input.ToLower().Replace(" ", "");
+            input = input.ToLower().Replace(" ", "Stryker was here!");
             char[] arr = input.ToCharArray();
             Array.Reverse(arr);
killedBy: StringManipulator.Tests.StringUtilitiesTests.TestIsPalindrome_True

[Killed] Statement mutation
09.StringManipulatorProject/StringManipulator/StringManipulator/StringUtilities.cs:12:13
             if (string.IsNullOrWhiteSpace(input)) return false;
             input = input.ToLower().Replace(" ", "");
             char[] arr = input.ToCharArray();
-            Array.Reverse(arr);
+            ;
             return input == new string(arr);
         }
killedBy: StringManipulator.Tests.StringUtilitiesTests.TestIsPalindrome_False

[Killed] Equality mutation
09.StringManipulatorProject/StringManipulator/StringManipulator/StringUtilities.cs:13:20
             input = input.ToLower().Replace(" ", "");
             char[] arr = input.ToCharArray();
             Array.Reverse(arr);
-            return input == new string(arr);
+            return input != new string(arr);
         }
     }
killedBy: StringManipulator.Tests.StringUtilitiesTests.TestIsPalindrome_True; StringManipulator.Tests.StringUtilitiesTests.TestIsPalindrome_False
