[Killed] BlockStatement
src/calculator.js:5:25
   return a + b;
 }
 
-function subtract(a, b) {
-  return a - b;
-}
+function subtract(a, b) {}
 
 function multiply(a, b) {
killedBy: subtracts two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:6:10
 }
 
 function subtract(a, b) {
-  return a - b;
+  return a + b;
 }
 
killedBy: subtracts two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 8

[Killed] BlockStatement
src/calculator.js:13:23
   return a * b;
 }
 
-function divide(a, b) {
-  if (b === 0) {
-    throw new Error("Cannot divide by zero");
-  }
-  return a / b;
-}
+function divide(a, b) {}
 
 module.exports = {
killedBy: divides two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/calculator.js:14:16
 }
 
 function divide(a, b) {
-  if (b === 0) {
-    throw new Error("Cannot divide by zero");
-  }
+  if (b === 0) {}
   return a / b;
 }
killedBy: throws error when dividing by zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot divide by zero"

Received function did not throw

[Killed] EqualityOperator
src/calculator.js:14:7
 }
 
 function divide(a, b) {
-  if (b === 0) {
+  if (b !== 0) {
     throw new Error("Cannot divide by zero");
   }
killedBy: divides two numbers
statusReason: Error: Cannot divide by zero

[Killed] StringLiteral
src/calculator.js:15:21
 
 function divide(a, b) {
   if (b === 0) {
-    throw new Error("Cannot divide by zero");
+    throw new Error("");
   }
   return a / b;
killedBy: throws error when dividing by zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot divide by zero"
Received message:   ""

      80 |       } else {
      81 |         stryCov_9fa48("10");
    > 82 |         throw new Error(stryMutAct_9fa48("11") ? "" : (stryCov_9fa48("11"), "Cannot divide by zero"));
