[Killed] Boolean mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:14:28
         {
             _correctCode = correctCode;
             _attempts = 0;
-            _isLockedOut = false;
+            _isLockedOut = true;
         }
 
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint; PadlockApp.Tests.PadlockTests.Unlock_WithCorrectCode_ReturnsUnlocked

[Killed] Negate expression
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:19:17
 
         public string TryUnlock(string input)
         {
-            if (_isLockedOut) return "Locked out!";
+            if (!(_isLockedOut)) return "Locked out!";
             if (_attempts >= MaxAttempts)
             {
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint; PadlockApp.Tests.PadlockTests.Unlock_WithCorrectCode_ReturnsUnlocked

[Killed] String mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:19:38
 
         public string TryUnlock(string input)
         {
-            if (_isLockedOut) return "Locked out!";
+            if (_isLockedOut) return "";
             if (_attempts >= MaxAttempts)
             {
killedBy: PadlockApp.Tests.PadlockTests.Unlock_AfterLockout_ReturnsLockedOut

[Killed] Negate expression
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:20:17
         public string TryUnlock(string input)
         {
             if (_isLockedOut) return "Locked out!";
-            if (_attempts >= MaxAttempts)
+            if (!(_attempts >= MaxAttempts))
             {
                 _isLockedOut = true;
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint; PadlockApp.Tests.PadlockTests.Unlock_WithCorrectCode_ReturnsUnlocked

[Killed] Equality mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:20:17
         public string TryUnlock(string input)
         {
             if (_isLockedOut) return "Locked out!";
-            if (_attempts >= MaxAttempts)
+            if (_attempts < MaxAttempts)
             {
                 _isLockedOut = true;
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint; PadlockApp.Tests.PadlockTests.Unlock_WithCorrectCode_ReturnsUnlocked

[NoCoverage] Boolean mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:22:32
             if (_isLockedOut) return "Locked out!";
             if (_attempts >= MaxAttempts)
             {
-                _isLockedOut = true;
+                _isLockedOut = false;
                 return "Locked out!";
             }

[NoCoverage] String mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:23:24
             if (_attempts >= MaxAttempts)
             {
                 _isLockedOut = true;
-                return "Locked out!";
+                return "";
             }
 

[Killed] Statement mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:26:13
                 return "Locked out!";
             }
 
-            _attempts++;
+            ;
             if (input == _correctCode)
                 return "Unlocked!";
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithTooManyAttempts_ReturnsLockedOut; PadlockApp.Tests.PadlockTests.Unlock_AfterLockout_ReturnsLockedOut

[Killed] PostIncrementExpression to PostDecrementExpression mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:26:13
                 return "Locked out!";
             }
 
-            _attempts++;
+            _attempts--;
             if (input == _correctCode)
                 return "Unlocked!";
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithTooManyAttempts_ReturnsLockedOut; PadlockApp.Tests.PadlockTests.Unlock_AfterLockout_ReturnsLockedOut

[Killed] Equality mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:27:17
             }
 
             _attempts++;
-            if (input == _correctCode)
+            if (input != _correctCode)
                 return "Unlocked!";
 
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint; PadlockApp.Tests.PadlockTests.Unlock_WithTooManyAttempts_ReturnsLockedOut; PadlockApp.Tests.PadlockTests.Unlock_WithCorrectCode_ReturnsUnlocked

[Killed] Equality mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:30:17
             if (input == _correctCode)
                 return "Unlocked!";
 
-            if (_attempts >= MaxAttempts)
+            if (_attempts > MaxAttempts)
             {
                 _isLockedOut = true;
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithTooManyAttempts_ReturnsLockedOut

[Killed] Negate expression
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:30:17
             if (input == _correctCode)
                 return "Unlocked!";
 
-            if (_attempts >= MaxAttempts)
+            if (!(_attempts >= MaxAttempts))
             {
                 _isLockedOut = true;
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint

[Killed] PostIncrementExpression to PostDecrementExpression mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:42:74
         private string ProvideHint(string input)
         {
             int correctPosition = 0;
-            for (int i = 0; i < input.Length && i < _correctCode.Length; i++)
+            for (int i = 0; i < input.Length && i < _correctCode.Length; i--)
             {
                 if (input[i] == _correctCode[i])
killedBy: PadlockApp.Tests.PadlockTests.Unlock_WithIncorrectCode_ReturnsHint; PadlockApp.Tests.PadlockTests.Unlock_WithTooManyAttempts_ReturnsLockedOut; PadlockApp.Tests.PadlockTests.Unlock_AfterLockout_ReturnsLockedOut

[Survived] Logical mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:42:29
         private string ProvideHint(string input)
         {
             int correctPosition = 0;
-            for (int i = 0; i < input.Length && i < _correctCode.Length; i++)
+            for (int i = 0; i < input.Length || i < _correctCode.Length; i++)
             {
                 if (input[i] == _correctCode[i])

[Survived] Equality mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:44:21
             int correctPosition = 0;
             for (int i = 0; i < input.Length && i < _correctCode.Length; i++)
             {
-                if (input[i] == _correctCode[i])
+                if (input[i] != _correctCode[i])
                     correctPosition++;
             }

[Survived] Statement mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:45:21
             for (int i = 0; i < input.Length && i < _correctCode.Length; i++)
             {
                 if (input[i] == _correctCode[i])
-                    correctPosition++;
+                    ;
             }
             return $"{correctPosition} digits in the correct position.";

[Survived] PostIncrementExpression to PostDecrementExpression mutation
PadlockProject/PadlockProject/PadlockApp/Padlock.cs:45:21
             for (int i = 0; i < input.Length && i < _correctCode.Length; i++)
             {
                 if (input[i] == _correctCode[i])
-                    correctPosition++;
+                    correctPosition--;
             }
             return $"{correctPosition} digits in the correct position.";
